; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v1 - type_3 ?v8 - type_1)
 	      (pred_4 ?v4 - object ?v8 - type_1)
	      (pred_3 ?v1 - type_3 ?v7 - type_2)
	      (pred_2 ?v1 - type_3 ?v4 - object ?v7 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v3 ?v6 - type_1)
       :precondition (and  (pred_1 ?v1 ?v3))
       :effect (and  (pred_1 ?v1 ?v6)
		     (not (pred_1 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_3 ?v5 - object ?v2 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v2) (pred_1 ?v1 ?v2) (pred_3 ?v1 ?v7))
       :effect (and (pred_2 ?v1 ?v5 ?v7)
		    (not (pred_4 ?v5 ?v2)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_3 ?v5 - object ?v2 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v5 ?v7) (pred_1 ?v1 ?v2))
       :effect (and (pred_4 ?v5 ?v2)
		    (pred_3 ?v1 ?v7)
		    (not (pred_2 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_05 - type_3
obj_03 obj_13 obj_02 obj_07 - type_2
obj_08 obj_04 obj_10 obj_06 - type_1
obj_01 obj_11 obj_09 - object)
(:init
(pred_1 obj_12 obj_08)
(pred_3 obj_12 obj_03)
(pred_3 obj_12 obj_13)
(pred_1 obj_05 obj_06)
(pred_3 obj_05 obj_02)
(pred_3 obj_05 obj_07)
(pred_4 obj_01 obj_10)
(pred_4 obj_11 obj_08)
(pred_4 obj_09 obj_06)
)
(:goal
(and
(pred_4 obj_01 obj_10)
(pred_4 obj_11 obj_06)
(pred_4 obj_09 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_12 obj_06) (pred_1 obj_05 obj_06))))
  )
)
)

; plan
1. (op_1 obj_05 obj_09 obj_06 obj_07)
   deleted: (pred_4 obj_09 obj_06) (pred_3 obj_05 obj_07)
   added: (pred_2 obj_05 obj_09 obj_07)
   goals met: 1 of 3
2. (op_1 obj_12 obj_11 obj_08 obj_13)
   deleted: (pred_4 obj_11 obj_08) (pred_3 obj_12 obj_13)
   added: (pred_2 obj_12 obj_11 obj_13)
   goals met: 1 of 3
3. (op_3 obj_05 obj_06 obj_10)
   deleted: (pred_1 obj_05 obj_06)
   added: (pred_1 obj_05 obj_10)
   goals met: 1 of 3
4. (op_3 obj_12 obj_08 obj_06)
   deleted: (pred_1 obj_12 obj_08)
   added: (pred_1 obj_12 obj_06)
   goals met: 1 of 3
5. (op_2 obj_12 obj_11 obj_06 obj_13)
   deleted: (pred_2 obj_12 obj_11 obj_13)
   added: (pred_4 obj_11 obj_06) (pred_3 obj_12 obj_13)
   goals met: 2 of 3
6. (op_2 obj_05 obj_09 obj_10 obj_07)
   deleted: (pred_2 obj_05 obj_09 obj_07)
   added: (pred_4 obj_09 obj_10) (pred_3 obj_05 obj_07)
   goals met: 3 of 3
